app/controllers/home_controller.rb

  def index
  	@post = Post.all.orser('created_at DESC')
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC