app/controllers/posts_controller.rb

  def create
    @post = Post.create(post_params)
    # binding.pry
    if @post.save
---
INSERT INTO "posts" ("title", "body", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
INSERT INTO "posts" ("title", "body", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "fwef"], ["body", "fwefw"], ["author", "fwefe"], ["created_at", "2018-11-28 12:52:57.876721"], ["updated_at", "2018-11-28 12:52:57.876721"]]

  def destroy
  	@post.delete
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 22]]

  def find_post
        # binding.pry
  	@post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]